{
  "clients": 3,
  "years": 4,
  "experiences": [
    {
      "position_es": "Desarrollador Backend",
      "position_en": "Backend Developer",
      "company": "Gordian",
      "time": "Agosto 2023 - Actualidad",
      "address": "Remoto",
      "work_es": "Desarrollo y mantenimiento de APIs versionadas con OpenAPI 3.0. Integraciones con proveedores GDS (Travelport, Sabre, Amadeus). Pipelines asíncronos con Celery + Redis. Automatización y scraping de datos.",
      "work_en": "Development and maintenance of versioned APIs with OpenAPI 3.0. Integrations with GDS providers (Travelport, Sabre, Amadeus). Asynchronous pipelines with Celery + Redis. Data automation and scraping."
    },
    {
      "position_es": "Desarrollador Full Stack",
      "position_en": "Full Stack Developer",
      "company": "TitanTech",
      "time": "Octubre 2021 - Junio 2023",
      "address": "Remoto",
      "work_es": "Desarrollo de aplicaciones web con React y Next.js. Implementación y consumo de APIs backend. Trabajo con bases de datos MySQL. Uso de Docker y control de versiones con GitHub.",
      "work_en": "Web application development with React and Next.js. Backend API implementation and consumption. Working with MySQL databases. Docker usage and version control with GitHub."
    },
    {
      "position_es": "Desarrollador Web Autodidacta",
      "position_en": "Self-taught Web Developer",
      "company": "Freelance",
      "time": "2021",
      "address": "Lomas de Zamora",
      "work_es": "Desarrollé páginas web estáticas y dinámicas, como e-commerce y portfolios, utilizando herramientas modernas.",
      "work_en": "Developed static and dynamic web pages, including e-commerce and portfolios, using modern tools."
    }
  ],
  "educations": [
    {
      "type": "Desarrollo Web Full Stack",
      "place": "Argentina Programa",
      "time": "",
      "info_es": "Programa de formación intensiva en desarrollo web full stack.",
      "info_en": "Intensive training program in full stack web development."
    },
    {
      "type": "Profesorado de Educación Tecnológica",
      "place": "ISFDyT Nº103",
      "time": "",
      "info_es": "Formación en educación tecnológica.",
      "info_en": "Education in technology teaching."
    }
  ],
  "skills": [
    {
      "name": "Python",
      "iconComponent": "Python",
      "experience": "1"
    },
    {
      "name": "Flask",
      "iconComponent": "Flask",
      "experience": "1"
    },
    {
      "name": "JavaScript",
      "iconComponent": "JsSkill",
      "experience": "1"
    },
    {
      "name": "ReactJS",
      "iconComponent": "ReactLogo",
      "experience": "1"
    },
    {
      "name": "NextJS",
      "iconComponent": "NextjsIcon",
      "experience": "1"
    },
    {
      "name": "PostgreSQL",
      "iconComponent": "PostgreSQL",
      "experience": "1"
    },
    {
      "name": "Redis",
      "iconComponent": "Redis",
      "experience": "1"
    },
    {
      "name": "Docker",
      "iconComponent": "Docker",
      "experience": "1"
    },
    {
      "name": "AWS",
      "iconComponent": "AWS",
      "experience": "1"
    },
    {
      "name": "HTML",
      "iconComponent": "HTML",
      "experience": "1"
    },
    {
      "name": "CSS",
      "iconComponent": "CSS",
      "experience": "1"
    },
    {
      "name": "Wordpress",
      "iconComponent": "Wordpress",
      "experience": "1"
    }
  ],
  "links": {
    "github": "https://github.com/MauroDietze",
    "linkedin": "https://www.linkedin.com/in/mauro-dietze/"
  },
  "email": "mauro.dietze@gmail.com",
  "projects_cant": 2,
  "projects": [
    {
      "name": "Sitio Web para Fotógrafo de Bodas en WordPress",
      "descripcion_es": "Desarrollé un sitio web en WordPress para un fotógrafo de bodas en Guatemala, bajo la supervición de Titan Tech. El sitio no solo muestra su portafolio en forma de álbumes de bodas para los clientes, sino que también incluye herramientas para captar nuevos clientes mediante promociones y diversas opciones de contacto. Utilicé un tema personalizado y ajusté plugins para satisfacer las necesidades específicas del cliente, logrando una plataforma atractiva y funcional tanto en versiones de escritorio como móvil.",
      "descripcion_en": "I developed a WordPress website for a wedding photographer in Guatemala, under the supervision of Titan Tech. The site not only displays your portfolio in the form of wedding albums for clients, but also includes tools to attract new clients through promotions and various contact options. I used a custom theme and adjusted plugins to meet the client's specific needs, achieving an attractive and functional platform in both desktop and mobile versions.",
      "image": "jorgejarquin",
      "type": "Work Project",
      "github": "https://github.com/camilo-tt/jorgejarquin-web.git",
      "link": "https://jorgejarquin.com"
    },
    {
      "name": "E-Commerce con Vendure",
      "descripcion_es": "e-commerce diseñado para ofrecer una experiencia de compra rápida y fluida. Construido con Next.js y Tailwind CSS en el frontend, el sitio es completamente responsive y garantiza una navegación optimizada tanto en dispositivos móviles como en escritorio. En el backend, emplea Vendure para la gestión de productos, inventario y pedidos, y se integra con PostgreSQL como base de datos, asegurando la fiabilidad y escalabilidad de la plataforma.",
      "descripcion_en": "e-commerce designed to offer a fast and fluid purchasing experience. Built with Next.js and Tailwind CSS on the frontend, the site is fully responsive and ensures optimized navigation on both mobile and desktop devices. On the backend, it uses Vendure for product, inventory and order management, and integrates with PostgreSQL as a database, ensuring the reliability and scalability of the platform.",
      "image": "ecommerceImage",
      "type": "Project",
      "github": "https://github.com/villacentenariotech/front_ecommerce",
      "link": "https://front-ecommerce-ashy.vercel.app/"
    }
  ]
}
